[
  {
    "text": "Title: 2026 BMW International Open with Jäger, Kaymer and Schmid – ten percent Christmas discount on tickets.\nContent: Tim HolzmuellerBMW GroupTel: +49-151-601-33309send an e-mail Tim HolzmuellerBMW Group +++ German trio Stephan Jäger, Martin Kaymer and Matti Schmid at 37th\n  BMW International Open +++ Only DP World Tour tournament in Germany to\n  take place from 1st to 5th July 2026 at Golfclub München Eichenried\n  +++ Ten percent off general admissions and VIP tickets until 24th\n  December 2025 +++ New after-work ticket available +++ Munich.The triad of world-class golf, sheer driving\n  pleasure, and a dash of Bavarian zest in Germany since 1989 has been\n  named the BMW International Open. The tournament has long been an\n  institution on the DP World Tour; no other event has been\n  collaborating with the same title partner without interruption for as\n  long. The 37th edition of the BMW International Open will take place\n  between 1st and 5th July 2026 (Golfclub München Eichenried). Three of\n  Germany’s top players – Stephan Jäger, Matti Schmid and two-time Major\n  winner Martin Kaymer – have already confirmed their participation,\n  with further national and international stars set to follow. Tickets\n  for what is currently the only German stop on the DP World Tour\n  calendar are available from the official ticket shop, and you can take\n  advantage of a ten percent Christmas discount until 24th December 2025:https://www.bmw-golfsport.com/en/content/tickets.html The last time that Stephan Jäger teed off at his home club was in\n  2021. The 36-year-old has been living in the USA with his family for\n  many years and has made a name for himself on the PGA TOUR. Jäger had\n  intended to return to the place where he grew up and learned to play\n  golf to take part in this year’s BMW International Open. However, a\n  joyous occasion in July 2025 prevented him from returning home as\n  Jäger’s second son entered the world. Now there is nothing stopping\n  him from competing next summer. The winner of the 2024 Texas\n  Children's Houston Open said: “I’m really looking forward to finally\n  playing at Eichenried again and enjoying the BMW International Open.\n  Having a tournament like this in your hometown is a rare and lucky\n  coincidence. I can’t wait to enjoy this week with my family as well as\n  old friends and colleagues in front of a German crowd.” Two-time Major winner Martin Kaymer is another golfer not wanting to\n  miss out on this experience, and he enjoys a special connection with\n  the BMW International Open. The 40-year-old currently holds two\n  tournament records: he is the only German winner and the youngest\n  champion. Kaymer was 23 years and 177 days old when he won in Munich\n  in 2008, but that is not the only reason that the event is one of his\n  favourite tournaments. He said: “The people that you work alongside\n  make a huge difference. You can tell that everyone at BMW is\n  incredibly passionate about the tournament. Which makes it enjoyable\n  for us as players, and I’m always grateful that we have a fantastic\n  event like this here in Germany. Coming here is a source of great joy.” It is this joy that Matti Schmid also associates with the BMW\n  International Open. The Bavarian golfer, who predominantly plays on\n  the PGA TOUR in the USA, has the iconic German tournament marked as a\n  highlight on his calendar every year. As a child, the now 28-year-old\n  watched the pros at Golfclub München Eichenried with great enthusiasm,\n  and now the next generation of golfers are looking up to him: Schmid\n  is currently the best-placed German golfer in the world rankings. At\n  the 2025 BMW International Open he was the best home-grown player,\n  finishing in joint seventh, and he cannot wait for the next edition:\n  “The atmosphere was incredible throughout the week. I hope that\n  everyone will be coming back because it’s great when we have a full\n  house here.” The Christmas promotional discount applies to day tickets and\n  tournament tickets, as well as to Fairway Club tickets – excluding\n  tickets that have already been discounted such as those for young\n  people, students or people with disabilities. The ticket price\n  includes a free shuttle bus service between Ismaning station and the\n  golf club from Thursday to Sunday, and free car parking at the\n  tournament site, subject to availability. There is no general\n  admission fee for the Pro-Am tournament (Wednesday 1st July 2026).\n  Children up to and including 14 years of age also enjoy free entry on\n  all days. New for the 2026 BMW International Open, an after-work ticket will be\n  available for the Thursday or Friday. It will be valid as of 15:00 and\n  can be purchased for half the cost of a day ticket. For information\n  and prices, see the ticket shop at:https://www.bmw-golfsport.com/en/content/tickets.html Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Technical specifications of the MINI John Cooper Works, valid from 11/2024.\nContent: Julian KischBMW GroupTel: +49-151-601-38072send an e-mail Julian KischBMW Group In the attachment you will find the technical specifications of the\n  MINI John Cooper Works, valid from 11/2024. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: 50 years of the BMW 3 series.\nContent: Marc ThiesbuergerBMW GroupTel: +49-151-601-76534send an e-mail Marc ThiesbuergerBMW Group On the occasion of the 50th anniversary of the BMW 3 Series, the\n  press kit “40 Years of BMW 3 Series” from 2015 was comprehensively\n  revised, supplemented and updated.Please find it in the appendix. The following information relates to the current BMW 3 Series series:Outputs range from 110 kW/150 hp to 275 kW/374 hp. In addition\n  to the plug-in hybrid BMW 330e Sedan (WLTP: fuel consumption,\n  weighted, combined: 1.0 l/100 km [282.5 mpg imp] and 22.8 kWh/100 km;\n  CO2emissions, weighted, combined: 23 g/km; fuel\n  consumption with discharged battery: 7.7 l/100 km [36.7 mpg imp];\n  CO2classes: weighted, combined B, with discharged battery\n  F) and the BMW 330e Touring (WLTP: fuel consumption, weighted,\n  combined: 1.0 l/100 km [282.5 mpg imp] and 22.1 kWh/100 km;\n  CO2emissions, weighted, combined: 22 g/km; fuel\n  consumption with discharged battery: 7.5 l/100 km [37.7 mpg imp];\n  CO2classes: weighted, combined B, with discharged battery\n  F), the range also includes four highly efficient petrol and diesel\n  engines each. All diesel engines and the six-cylinder in-line petrol\n  engine feature advanced 48-volt mild-hybrid technology. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: BMW MUSEUM media information.\nContent: Lisa MeindlBMW GroupTel: +49-89-382-31668send an e-mail The BMW Museum in Munich takes its visitors on an impressive\n  journey through more than 100 years of car and motorcycle history\n  shaped by wonderment, innovation, dynamism and the joy of the open\n  road on two wheels and four. It charts a course from the early days to\n  the present day, and in so doing paints a comprehensive picture of the\n  BMW brand’s talent for innovation. Good news about the Museum has\n  travelled fast: with over 840,000 visitors in the past year, it is one\n  of Munich’s most popular. The BMW Museum is part of BMW Group Classic\n  – the wing of the company charged with nurturing the history of BMW\n  and everything that involves. History and Architecture. BMW has always demonstrated a keen awareness of its history. A\n  factory museum was opened at the Munich plant back in 1966, and in the\n  late 1960s the BMW Board of Management decided to build a museum to\n  reflect the company as a whole. Viennese architect Karl Schwanzer won\n  the competition to design the building, and the Museum was duly\n  created according to his plans. His was the inspiration behind the\n  Rotunda, also known informally as the “Bowl” on account of its\n  distinctive appearance. The Museum concept was presented in 1973 under\n  the heading “Streets and urban squares in the renovated exhibition\n  space”. A central ramp within the Rotunda connects a system of\n  apparently floating platforms. Design firm Atelier Brückner took the concept to the next stage with\n  the renovation and expansion of the Museum from 2004 to 2008, since\n  when the low-rise section of the building has been part of the overall\n  complex together with the “Bowl”. “Bridges and houses” have been added\n  to the architectural concept, which has expanded the surface area of\n  the Museum to five times its original size. A system of ramps shapes\n  the inner structure of the Museum. It reaches dynamically into the\n  space and appears to be almost weightless. The modern facades of the\n  seven exhibition houses, unusual lines of sight through the interior,\n  asphalt floors and upward-spiralling pathways through the exhibition\n  areas create a lively urban setting. Exhibition and Experiences. The permanent exhibition represents the core of the BMW Museum and\n  takes visitors on a themed journey from the past into the future. The\n  route leads guests through seven exhibition houses. The “House of\n  Design” is all about the design process and charts the progression\n  from idea brainstorming to style-defining product; the “House of the\n  Company” explores the history and company culture of BMW; and the\n  “House of the Motorcycle” studies the development of motorcycle design\n  and engineering at BMW. The “House of Technology” displays the\n  technical innovations BMW has employed to meet the evergrowing demands\n  of car and motorcycle design. In the “House of Motorsport”, the\n  history of BMW in race competition commands the spotlight. Here, we\n  showcase the full spectrum of technical possibilities, turned into\n  reality with no effort or endeavour spared. The “House of the Series” details the development of individual model\n  ranges, such as the BMW 5 Series. BMW’s lines of communication with\n  the people who use its vehicles is the theme for the “House of the\n  Brand”, which looks at customers’ personal experiences with BMW cars.\n  This house also examines the subject of sustainability at BMW. In\n  addition, the temporary exhibitions in the “Bowl” each have their own\n  theme and are dedicated to particular subject areas at the company.\n  Examples have included the BMW i brand and the overall sphere of\n  electric mobility. Since the BMW Museum re-opened in 2008, it has used\n  special exhibitions like these to present topics in which the BMW\n  brand is deeply engaged. The hour-long guided tour through the permanent exhibition gives\n  visitors the chance to immerse themselves in the Museum’s wealth of\n  exhibits and gain some fascinating background insights into the\n  development of the BMW brand. The tours are led by recognised experts,\n  who are more than happy to incorporate specific topics or areas of\n  interest on request. The BMW Museum can also be explored digitally via\n  accompanying content on smartphones or tablets. Here, visitors can\n  find out more about the history of the BMW brand and have a lot of fun\n  in the process. The BMW Museum uses cashless purchase options only –\n  i.e. credit card, contactless methods or mobile wallet – for entry\n  tickets, Museum tours and souvenirs. Entry tickets can be paid for\n  online, using the ticket payment machines or at the cash desk. Guided\n  tours, kids’ birthday parties and school holiday activities can also\n  be booked online – up to six months in advance. The BMW Junior Museum is designed specifically for younger guests.\n  The BMW Junior Museum programme invites children and teenagers on a\n  journey of discovery through the world of mobility and is available\n  all year round. Workshops designed for the age group at hand allow\n  young visitors to delve into interesting topics from different angles.\n  The workshops feature fascinating content on topics such as design,\n  architecture, art and sustainability, and fuel the creativity of the\n  kids. The tour through the BMW Museum included as part of the\n  workshops is designed to respond to the youngsters’ interests and meet\n  their needs. Interactive elements allow them to explore mobility from\n  a variety of perspectives and cast an eye over more than 100 years of\n  car and motorcycle history. The workshops are held in German and\n  English. The programme offered by the BMW Museum reflects its vision\n  of an extracurricular place of learning for interdisciplinary\n  educational experiences. The main objective of the BMW Museum’s\n  educational offering is to encourage active engagement with the\n  exhibits on display. The various workshops are geared to preschool,\n  primary-school and secondaryschool children respectively. The following workshops are offered at the BMW Junior Museum for\n  groups and school classes: These workshops can also be held as birthday celebration events,\n  which include the option of either bringing your own food or booking\n  refreshments from renowned caterers Feinkost Käfer. Several times a\n  year, the BMW Museum also adds a Family Sunday with its own particular\n  motto to the calendar. Here, the Museum lays on a wide range of\n  attractions, such as arts & crafts, face painting and much more\n  besides, and also invites guests to visit the exhibition areas of the\n  BMW Museum. Along the way, the kids explore topics around mobility,\n  design and sustainability. As part of its special school holiday\n  programme, the Museum now also allows places to be booked individually\n  for the Design Workshop held on every Thursday of the holidays. Here,\n  children aged between 7 and 13 can develop their own vehicle designs\n  under the guidance of our experts and with special tools. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Hypercar line-up 2026: BMW M Motorsport relies on consistency in the cockpits of the four BMW M Hybrid V8s.\nContent: Andrea SchwabBMW GroupTel: +49-89-382-60988send an e-mail Andrea SchwabBMW Group Munich. BMW M Motorsport relies on consistency for the\n    line-ups of its two Hypercar programmes in the FIA World Endurance\n    Championship (FIA WEC) and the IMSA WeatherTech SportsCar\n    Championship (IMSA Series) in 2026. The same eight BMW M works\n    drivers will take the wheel of the four BMW M Hybrid V8s as in 2025.\n    However, there will be a change in the regular driver pairings in\n    the IMSA Series. The eight drivers for BMW M Motorsport’s works programmes in the FIA\n  WEC and IMSA Series in 2026 are once again: Philipp Eng (AUT), Robin\n  Frijns (NED), Kevin Magnussen (DEN), Raffaele Marciello (SUI), René\n  Rast (GER), Sheldon van der Linde (RSA), Dries Vanthoor (BEL), and\n  Marco Wittmann (GER). As in the previous year, Vanthoor and van der\n  Linde will undertake double duty as regular drivers in both race\n  series. Eng and Wittmann will return for another full season in North\n  America, where BMW M Team WRT will take over operations from BMW M\n  Team RLL. Starting in 2026, the Belgian team will compete with the BMW\n  M Hybrid V8 in both the FIA WEC and IMSA Series. In FIA WEC, the driver line-ups for both cars remain unchanged. The\n  #15 BMW M Hybrid V8 will be shared by Magnussen, Marciello, and\n  Vanthoor. In the #20 car, Frijns, Rast, and van der Linde will\n  alternate. In the IMSA Series, there will be a swap in driver\n  pairings. Regular drivers in the #24 BMW M Hybrid V8 will be Vanthoor\n  and van der Linde. They will be supported in endurance races by Frijns\n  and Rast. In the #25 car, Eng and Wittmann will contest the full\n  season together. They will be joined by Magnussen and Marciello for\n  endurance races. Andreas Roos (Head of BMW M Motorsport):“Consistency\n  was our priority when selecting the Hypercar drivers for the 2026\n  season. We are very satisfied with the performance of all eight\n  drivers, and there is no reason to make major changes. With every\n  race, our drivers gain more experience with the BMW M Hybrid V8, which\n  is crucial for the continued progress of our programme. In 2026, we\n  will race with an updated car and a new team in the IMSA Series.\n  That’s enough change, so it was important for us to maintain\n  continuity on the driver side. The key is that everyone works well as\n  a team, pulls together, and advances our LMDh project. That’s exactly\n  what’s happening. I’m very much looking forward to continuing this collaboration.” Hypercar line-ups for 2026 at a glance: FIA WEC, #15 BMW M Hybrid V8:Kevin Magnussen (DEN)Raffaele Marciello (SUI)Dries\n  Vanthoor (BEL) FIA WEC, #20 BMW M Hybrid V8:Robin Frijns (NED)René Rast (GER)Sheldon van der\n  Linde (RSA) IMSA Series, #24 BMW M Hybrid V8:Sheldon van der Linde (RSA)Dries Vanthoor (BEL)Robin\n  Frijns (NED), EnduranceRené Rast (GER), 24h Daytona IMSA Series, #25 BMW M Hybrid V8:Philipp Eng (AUT)Marco Wittmann (GER)Kevin Magnussen\n  (DEN), EnduranceRaffaele Marciello (SUI), 24h Daytona Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Technical specifications of the MINI John Cooper Works Electric, valid from 11/2024.\nContent: Julian KischBMW GroupTel: +49-151-601-38072send an e-mail Julian KischBMW Group In the attachment you will find the technical specifications of the\n  MINI John Cooper Works Electric, valid from 11/2024. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Smart, safe, symbiotic: BMW Group is the first car manufacturer in Germany to receive international approval for innovative assistance systems in accordance with the new \"DCAS\" regulation.\nContent: Martin TholundBMW GroupTel: +49-151-601-77126send an e-mail Martin TholundBMW Group Munich.Comfortably rest your hands in your lap and\n  initiate overtaking maneuvers with a glance in the wing mirror – BMW\n  customers will soon be able to experience this in many more European\n  countries with the Motorway Assistant*. The BMW Group is the first car\n  manufacturer in Germany to receive approval for driver assistance\n  systems for the new BMW iX3 in accordance with UN Regulation No. 171\n  for Driver Control Assistance Systems (DCAS). The DCAS regulation\n  provides an international legal framework for innovative Level 2\n  driver assistance systems with a focus on customer safety. The\n  approval enables the BMW Group to offer the Motorway Assistant* with\n  Level 2 \"hands-off\" function in numerous other models and\n  countries in the future, as well as with an extended range of\n  functions. Further innovative assistance functions will also follow\n  for urban driving scenarios. The current generation of the Motorway\n  Assistant has just been awarded the Tech Award in the \"Comfort\n  assistance systems\" category by the German car magazine\n  \"auto motor und sport\". Dr. Mihiar Ayoubi, Senior Vice President Driving Experience\n    Development: \"The safety-oriented DCAS-regulation ensures that we can launch\n  our Motorway Assistant with hands-off function in many more countries.\n  Further innovative assistance systems with our special, symbiotic\n  approach between vehicle and driver will follow. We are creating a\n  perfect interplay between rule-based algorithms and artificial\n  intelligence. The driver remains involved, our systems are\n  controllable at all times, and their behaviour is reproducible.\" When the Motorway Assistant is activated, drivers can take their\n  hands off the steering wheel permanently at speeds of up to 130 km/h,\n  but must remain attentive and ready to intervene. The system assists\n  with vehicle guidance within its own lane and can also change lanes\n  automatically if necessary - all the driver needs to do is confirm\n  this with a glance. The new DCAS approval also enables even more\n  extensive functions. With active BMW Maps route guidance, the system\n  suggests a lane change in good time at Motorway junctions and exits,\n  which can be confirmed with a glance in the wing mirror. The Motorway\n  Assistant remains active when driving through freeway junctions and\n  until the end of freeway exits. This means that drivers of the BMW iX3\n  can enjoy Level 2 driver assistance in even more situations without\n  touching the steering wheel. The new Motorway and City Assistant* of the BMW iX3 also offers\n  innovative functions for urban areas. At market launch in Germany,\n  these include stopping at red lights and driving off again\n  automatically. Further driver assistance functions for complex driving\n  situations in urban areas will be rolled out at a later point in time\n  via over-the-air software updates. The Motorway Assistant of the previous technology generation\n  celebrated its premiere in the current 5 Series Sedan in 2023. The BMW\n  Group had received a limited exemption from the Federal Motor\n  Transport Authority in Germany for the approval of the system. With\n  DCAS approval, exemptions are no longer required, and the systems can\n  be offered throughout Europe and in other ECE countries. BMW Symbiotic Drive: next-generation symbiotic driver assistance. In addition to the new possibilities offered by the DCAS regulation\n  for driver assistance systems, the BMW Group continues to consistently\n  design its systems so that driver and driver assistance work together\n  symbiotically. BMW Symbiotic Drive creates a seamless transition\n  between assistance and driver input and reaches the next level of\n  development in the “Neue Klasse” vehicles. In addition to symbiotic\n  steering, the BMW iX3 is the world's first model with symbiotic\n  brakes. With active driver assistance, the driver can influence the\n  system individually at any time according to their wishes by lightly\n  intervening in steering and braking without switching off the driver\n  assistance. The system remains active to provide support. The\n  innovative power of the symbiotic brake is underpinned by more than\n  two dozen BMW Group patent applications resulting from the development\n  of these technologies. * The Highway & City Assistant will be available in Germany\n    for market launch of the BMW iX3. Other countries and functions will\n    follow. The availability, range of functions and system limits of\n    the Highway & City Assistant may vary from country to country. BMW iX3 50 xDrive WLTP energy consumption combined: 17,9 - 15,1\n  kWh/100 km; WLTP CO₂ emissions combined: 0 g/km; CO2-class: A; WLTP\n  electric range: 679 - 805 km. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: 2026 BMW International Open with Jäger, Kaymer and Schmid – ten percent Christmas discount on tickets.\nContent: Tim HolzmuellerBMW GroupTel: +49-151-601-33309send an e-mail Tim HolzmuellerBMW Group +++ German trio Stephan Jäger, Martin Kaymer and Matti Schmid at 37th\n  BMW International Open +++ Only DP World Tour tournament in Germany to\n  take place from 1st to 5th July 2026 at Golfclub München Eichenried\n  +++ Ten percent off general admissions and VIP tickets until 24th\n  December 2025 +++ New after-work ticket available +++ Munich.The triad of world-class golf, sheer driving\n  pleasure, and a dash of Bavarian zest in Germany since 1989 has been\n  named the BMW International Open. The tournament has long been an\n  institution on the DP World Tour; no other event has been\n  collaborating with the same title partner without interruption for as\n  long. The 37th edition of the BMW International Open will take place\n  between 1st and 5th July 2026 (Golfclub München Eichenried). Three of\n  Germany’s top players – Stephan Jäger, Matti Schmid and two-time Major\n  winner Martin Kaymer – have already confirmed their participation,\n  with further national and international stars set to follow. Tickets\n  for what is currently the only German stop on the DP World Tour\n  calendar are available from the official ticket shop, and you can take\n  advantage of a ten percent Christmas discount until 24th December 2025:https://www.bmw-golfsport.com/en/content/tickets.html The last time that Stephan Jäger teed off at his home club was in\n  2021. The 36-year-old has been living in the USA with his family for\n  many years and has made a name for himself on the PGA TOUR. Jäger had\n  intended to return to the place where he grew up and learned to play\n  golf to take part in this year’s BMW International Open. However, a\n  joyous occasion in July 2025 prevented him from returning home as\n  Jäger’s second son entered the world. Now there is nothing stopping\n  him from competing next summer. The winner of the 2024 Texas\n  Children's Houston Open said: “I’m really looking forward to finally\n  playing at Eichenried again and enjoying the BMW International Open.\n  Having a tournament like this in your hometown is a rare and lucky\n  coincidence. I can’t wait to enjoy this week with my family as well as\n  old friends and colleagues in front of a German crowd.” Two-time Major winner Martin Kaymer is another golfer not wanting to\n  miss out on this experience, and he enjoys a special connection with\n  the BMW International Open. The 40-year-old currently holds two\n  tournament records: he is the only German winner and the youngest\n  champion. Kaymer was 23 years and 177 days old when he won in Munich\n  in 2008, but that is not the only reason that the event is one of his\n  favourite tournaments. He said: “The people that you work alongside\n  make a huge difference. You can tell that everyone at BMW is\n  incredibly passionate about the tournament. Which makes it enjoyable\n  for us as players, and I’m always grateful that we have a fantastic\n  event like this here in Germany. Coming here is a source of great joy.” It is this joy that Matti Schmid also associates with the BMW\n  International Open. The Bavarian golfer, who predominantly plays on\n  the PGA TOUR in the USA, has the iconic German tournament marked as a\n  highlight on his calendar every year. As a child, the now 28-year-old\n  watched the pros at Golfclub München Eichenried with great enthusiasm,\n  and now the next generation of golfers are looking up to him: Schmid\n  is currently the best-placed German golfer in the world rankings. At\n  the 2025 BMW International Open he was the best home-grown player,\n  finishing in joint seventh, and he cannot wait for the next edition:\n  “The atmosphere was incredible throughout the week. I hope that\n  everyone will be coming back because it’s great when we have a full\n  house here.” The Christmas promotional discount applies to day tickets and\n  tournament tickets, as well as to Fairway Club tickets – excluding\n  tickets that have already been discounted such as those for young\n  people, students or people with disabilities. The ticket price\n  includes a free shuttle bus service between Ismaning station and the\n  golf club from Thursday to Sunday, and free car parking at the\n  tournament site, subject to availability. There is no general\n  admission fee for the Pro-Am tournament (Wednesday 1st July 2026).\n  Children up to and including 14 years of age also enjoy free entry on\n  all days. New for the 2026 BMW International Open, an after-work ticket will be\n  available for the Thursday or Friday. It will be valid as of 15:00 and\n  can be purchased for half the cost of a day ticket. For information\n  and prices, see the ticket shop at:https://www.bmw-golfsport.com/en/content/tickets.html Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Stefan Hienzsch takes over as Head of BMW Bank\nContent: Lennart WermkeBMW GroupTel: +49-151-601-980-96send an e-mail Lennart WermkeBMW Group Munich.BMW Bank GmbH is\n  strengthening its profile on the path to becoming a digitalized bank\n  with high innovation standards: Stefan Hienzsch has been appointed as\n  the new Chairman of the Board of Management with effect from 1\n  December. As one of Germany's leading automotive banks, the credit\n  institution is further enhancing its management board in an\n  increasingly complex regulatory environment. Hienzsch, a fully\n  qualified lawyer, has already been Chief Representative of BMW Bank\n  since June 2024. The management board remains unchanged, with Joachim\n  Herr, Torsten Matheis and Kerstin Zerbst continuing in their roles.\"Stefan Hienzsch is an experienced financial and legal\n  expert who is very familiar with the challenges and opportunities of\n  the BMW Group's financial services business. Under his leadership, BMW\n  Bank will continue to expand its role as a reliable, innovative\n  partner for our customers and dealers and continue to make a\n  significant contribution to the success of the BMW Group in Germany\n  and Europe,\" said Alexander Buresch, Chairman of the Supervisory\n  Board of BMW Bank and Head of BMW Group Financial Services.Hienzsch has more than 25 years of experience within the\n  company. Previously, he headed the BMW Group's legal department for\n  Corporate Finance, Financial Services and Mergers & Acquisitions\n  for over a decade and held various leadership roles in the UK for the\n  BMW, MINI and Rolls-Royce brands.\"I am very pleased about the trust placed in me and look\n  forward to my new role. BMW Bank will continue to systematically\n  pursue its digital transformation process. My goal is to inspire\n  customers and retailers with innovative, digital and sustainable\n  solutions and to further develop the bank as a strong, future-oriented\n  partner in the BMW Group ecosystem,\" says Stefan Hienzsch.Information for editors BMW Bank GmbH is one of the leading automotive banks in Germany\n    with subsidiaries in Italy, Spain and Portugal. More than 1,170\n    employees serve around one million customers (as of December 31,\n    2024). The product range extends from financing, leasing and\n    insurance for cars and motorcycles to deposit products and credit cards.The company has total assets of 28.5 billion euros) and deposits\n    of around 11.9 billion euros (both as of December 31, 2024). BMW\n    Bank GmbH is part of BMW Group Financial Services. Almost every\n    second new BMW and MINI vehicle is financed or leased through BMW\n    Group Financial Services.For queries, please contact:BMW GroupCorporate CommunicationsLennart Wermke, Communication BMW Group Financial\n  ServicesTelephone: +49 151 601 980 96E-Mail:lennart.wermke@bmwgroup.comMax-Morten Borgmann, Head of Communication Corporate, Finance,\n  SalesTelephone: +49 151 601 24 118E-Mail:max-morten.borgmann@bmwgroup.comInternet:www.press.bmwgroup.com/deutschlandE-Mail:presse@bmwgroup.comThe BMW GroupWith its four brands BMW, MINI, Rolls-Royce and BMW\n  Motorrad, the BMW Group is the world’s leading premium manufacturer of\n  automobiles and motorcycles and also provides premium financial\n  services. The BMW Group production network comprises over 30\n  production sites worldwide; the company has a global sales network in\n  more than 140 countries.In 2024, the BMW Group sold over 2.45 million passenger vehicles\n  and more than 210,000 motorcycles worldwide. The profit before tax in\n  the financial year 2024 was €11.0 billion on revenues amounting to\n  €142.4 billion. As of 31 December 2024, the BMW Group had a workforce\n  of 159,104 employees.The economic success of the BMW Group has always been based on\n  long-term thinking and responsible action. Sustainability is a key\n  element of the BMW Group’s corporate strategy and covers all products\n  from the supply chain and production to the end of their useful life.LinkedIn:http://www.linkedin.com/company/bmw-group/ YouTube:https://www.youtube.com/bmwgroup Instagram:https://www.instagram.com/bmwgroup Facebook:https://www.facebook.com/bmwgroup X:https://www.x.com/bmwgroup Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Technical specifications of the MINI John Cooper Works Aceman, valid from 01/2025.\nContent: Julian KischBMW GroupTel: +49-151-601-38072send an e-mail Julian KischBMW Group In the attachment you will find the technical specifications of the\n  MINI John Cooper Works Aceman, valid from 01/2025. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: The new BMW M2 CS.\nContent: Laura ClaesgensBMW GroupTel: +49-151-601-47299send an e-mail Laura ClaesgensBMW Group The new version of this special edition offers the ultimate in\n  driving pleasure – both as a track tool and in day-to-day use. Like\n  the BMW M2 Racing, which is based on the chassis from the\n  latest-generation M2, the BMW M2 CS will be manufactured at BMW Group\n  Plant San Luis Potosí in Mexico. As has become familiar with other\n  special-edition models from BMW M GmbH, the BMW M2 CS will be produced\n  in limited numbers. The key sales markets are the USA, Germany and\n  China. The market launch will begin in late summer 2025. The BMW M2 CS\n  will be priced at € 115,000 in Germany. The new BMW M2 CS is based on the second generation of the BMW M2\n  (fuel consumption, combined: 9.8 l/100 km [28.8 mpg imp];\n  CO2emissions, combined: 223 g/km in the WLTP cycle,\n  CO2class: G) and significantly improves what is already an\n  extraordinary level of performance. For example, the high-revving\n  six-cylinder in-line engine with M TwinPower Turbo technology develops\n  an impressive 390 kW/530 hp in the BMW M2 CS. That is 37 kW/50 hp more\n  than in the current BMW M2. As such, the BMW M2 CS matches the\n  performance of the BMW M3 Competition Sedan with M xDrive (fuel\n  consumption, combined: 10.2 l/100 km [27.7 mpg imp]; CO2emissions, combined: 230 g/km in the WLTP cycle, CO2class:\n  G) and the BMW M4 Competition Coupé with M xDrive (fuel consumption,\n  combined: 10.1 l/100 km [28.0 mpg imp]; CO2emissions,\n  combined: 229 g/km in the WLTP cycle, CO2class: G). The\n  BMW M2 CS sends its power to the rear wheels via the eight-speed\n  M Steptronic transmission with Drivelogic, which comes as standard. Noticeable weight reduction thanks to intelligent lightweight design BMW M GmbH has reduced the weight of the special edition by roughly\n  30 kilograms compared to the standard M2. This has been achieved\n  through modifications including judicious use of lightweight design\n  techniques. For example, the BMW M2 CS features a multitude of\n  exterior and interior components made from carbon-fibre-reinforced\n  plastic (CFRP). And it will be fitted as standard with forged M\n  light-alloy wheels. As a result, the CS will be the lightest BMW M2 so\n  far in the current generation. Upgraded six-cylinder in-line engine with significant increase\n    in power output and torque For the BMW M2 CS, BMW M GmbH has opted for an upgraded version of\n  the 3.0-litre, six-cylinder in-line engine found in the standard M2.\n  This intensifies the performance experience in the special edition,\n  particularly in highly dynamic driving situations. It further sharpens\n  the engine’s unmistakable power characteristics and perfectly\n  accentuates the linear power delivery – sustained into the higher\n  reaches of the rev range – familiar from M models. Compared to the BMW\n  M2 with standard eight-speed M Steptronic transmission with\n  Drivelogic, maximum torque has been raised by 50 Nm (37 lb-ft) to 650\n  Nm (479 lb-ft) and is available across a broad rev range – between\n  2,650 and 5,730 rpm. The engine produces its maximum power output of\n  390 kW/530 hp at 6,250 rpm, with the engine speed topping out at 7,200\n  rpm. In order to allow extremely rapid reactions to the driver’s\n  requests for acceleration and to make the improved performance\n  characteristics of the engine a particularly intense experience, the\n  accelerator mapping and response have been optimised in all the drive\n  modes, which are selectable via the M Setup menu. Racing expertise delivers inspiring performance With its improved peak performance, the new BMW M2 CS is\n  consolidating its claim to top spot in the compact high-performance\n  segment. This performance specification is achieved by modifying the\n  engine management and provides further proof of the outstanding\n  potential of the six-cylinder in-line engine developed by BMW M GmbH,\n  which also serves as the basis for the power unit used in the\n  BMW M4 GT3 EVO racing car. The engine’s M TwinPower Turbo technology\n  comprises a pair of mono-scroll turbochargers, which each supply three\n  cylinders with compressed air, an indirect intercooler supplied by a\n  low-temperature circuit, and an electronically controlled wastegate.\n  The technology package also includes High Precision Injection, which\n  operates with maximum pressure of 350 bar, VALVETRONIC variable valve\n  timing and Double-VANOS fully variable camshaft timing. The engine\n  also has an array of details borrowed directly from racing car design,\n  including its lightning-fast response, appetite for revs and\n  high-performance capability in track use. These details include an\n  extremely rigid crankcase with a sleeve-free, closed-deck\n  construction, a forged crankshaft with lightweight design, cylinder\n  bores with a wire-arc sprayed iron coating and a 3D-printed core for\n  the cylinder head. The M-specific cooling system ensures the powertrain components\n  maintain an optimal operating temperature even under heavy loads and\n  the oil circuit is designed to handle extreme dynamic driving\n  situations. A map-controlled oil pump ensures reliable oil supply even\n  under extreme acceleration. The engine sends its drive power through an eight-speed M Steptronic\n  transmission with Drivelogic as standard. The Drivelogic button\n  integrated into the selector lever makes it possible to alter the\n  transmission’s shift characteristics, with a choice of three clearly\n  distinguishable settings. Both the selector lever in the latest\n  M design and the gearshift paddles on the steering wheel enable\n  sequential interventions in the gear selection process at any time. BMW M2 CS breaks the four-second barrier A model-specific engine mounting with a higher spring rate makes for\n  a particularly rigid connection of the drive unit to the structure of\n  the BMW M2 CS. The extremely direct transmission of power to the\n  drivetrain optimises response. Thanks to the lightning-fast power\n  delivery, in combination with the increased engine power and the car’s\n  lighter weight, the BMW M2 CS is able to break the four-second barrier\n  for the sprint from 0 to 100 km/h (62 mph). It’s time of 3.8 seconds\n  is 0.2 seconds faster than for the standard M2. The figure calculated\n  using the “1-foot rollout” method** is 3.5 seconds. The increase in\n  power also enhances acceleration from rest to 200 km/h (124 mph). The\n  time required here is reduced by 1.2 seconds to 11.7 seconds – or\n  11.4 seconds according to the “1‑foot rollout” method**. The mid-range\n  sprint from 80 to 120 km/h (50 – 75 mph) takes 3.4 seconds. The\n  top speed of the special-edition model, which comes with the\n  M Driver’s Package as standard, is electronically limited to 302 km/h\n  (188 mph). The dynamic power delivery is backed by an emotionally rich\n  engine note conjured by the M-specific exhaust system with\n  electrically controlled flaps and the four exhaust pipes typical of M,\n  which come in matt black on the BMW M2 CS. For those wishing to\n  retrofit their car, the M Performance silencer system with carbon and\n  titanium tailpipe trims developed specifically for CS models is\n  available for the first time in the range of M Performance Parts for\n  the BMW M2 CS. The lightweight valve exhaust system with titanium\n  mufflers generates a racing-car sound guaranteed to stir the emotions.\n  The Active Sound Design helps to convey the engine’s soundtrack\n  authentically inside the cabin, with the intensity raised another\n  notch when SPORT or SPORT PLUS mode is selected using the Driving\n  Experience Control switch. Chassis and brakes optimised for increased performance The chassis technology and braking system in the BMW M2 CS are\n  precisely tailored to the improved performance characteristics of the\n  engine and the specific weight balance of the special edition. The\n  chassis has been lowered by eight millimetres and adapted specially\n  for the car with bespoke tuning for its springs, dampers and chassis\n  control systems. These modifications improve driving dynamics\n  significantly in all scenarios – including under extremely hard\n  driving. Indeed, the settings for the Dynamic Stability Control (DSC)\n  and M Dynamic Mode have been optimised precisely to meet the demands\n  of driving on the race track. The standard adaptive M chassis has been\n  given a carefully adapted model-specific setup, as have the M\n  Servotronic steering, M Sport differential and the integrated braking\n  system. An M Compound braking system with red brake callipers, which\n  comes as standard, provides powerful retardation. An M Carbon ceramic\n  brake system with red brake callipers is available as an option.\n  Standard equipment also includes CS-exclusive forged M light-alloy\n  wheels with a double-spoke design and matt Gold Bronze finish. They\n  measure 19 inches at the front and 20 inches at the rear axle and are\n  fitted as standard with track tyres, the dimensions of which are\n  275/35 ZR19 at the front and 285/30 ZR20 at the rear. An ultra-track\n  tyre and a standard sport tyre (a no-cost option) in the same\n  dimensions are available on request. Exterior features many carbon components and exclusive details The punchy exterior of the BMW M2 CS is shaped by many components\n  made of carbon-fibre-reinforced plastic (CFRP) and other exclusive\n  details. As well as the M exterior mirror caps familiar from the BMW\n  M2, the M Carbon roof – which comes as standard on the special-edition\n  model – and CS-specific rear diffusor are also made from eye-catching\n  exposed carbon fibre. A front splitter in matt black and an exclusive\n  black BMW M kidney grille with optimised air inlets complete the\n  sporty and dynamic look. The lightweight CFRP boot lid with integrated\n  ducktail is a real head-turner. The “M2 CS” logo on the rear has a red\n  outline. Four colours are available for the exterior finish of the new\n  BMW M2 CS: Sapphire Black metallic, BMW Individual Velvet Blue\n  metallic, M Brooklyn Grey metallic and M Portimao Blue metallic.\n  Adaptive LED Headlights with BMW Selective Beam non-dazzling High Beam\n  Assistant and M lights Shadowline with dark inlays are also standard. Carbon and racing flair continue inside The interior of the new BMW M2 CS combines an exclusive look with the\n  sporty feel of exquisite Alcantara and innovative lightweight design.\n  For example, the centre console is made of carbon-fibre-reinforced\n  plastic (CFRP). The driver and passenger take their places in\n  weight-optimised, heated M Carbon bucket seats with a wide range of\n  electrically controlled settings and an illuminated “CS” logo. The\n  integrated head restraints are removable and, thanks to the option of\n  integrating multi-point harnesses, improve the car’s track readiness.\n  The surfaces of the seats are finished in Merino leather. With a flat-bottomed rim, gearshift paddles, a red centre marker at\n  12 o’clock and two M buttons for selecting individually configured\n  vehicle setups, the standard M Alcantara steering wheel – which is\n  available in a heated version as an option and features a three-spoke\n  design – brings authentic racing flair to the cockpit. The trim\n  elements in the instrument panel and centre console come in M Carbon\n  Fibre. Additional specific details include the red “CS” logo on the\n  centre console, the M seatbelts and the entry door sill plates, which\n  are black with an “M2 CS” logo and red outline for the first time. Now\n  illuminated with the “CS” logo, the door trim panels certainly grab\n  the attention. The colour used here can be set individually, likewise\n  the standard ambient lighting. When switched off, a carbon structure\n  is visible. Rounding off the sporty interior is the M Anthracite headlining. BMW Operating System 8.5, digital control for the climate functions Standard equipment in the new BMW M2 CS also includes two-zone\n  automatic climate control, comfort access, the Harman Kardon Surround\n  Sound System and BMW Live Cockpit Professional, including the BMW Maps\n  navigation system. As well as the BMW Head-Up Display, it also\n  includes Augmented View on the control display. The standard\n  smartphone integration allows the use of Apple CarPlay® and\n  Android Auto™. The M-specific displays on the BMW Curved Display and\n  BMW Head-Up Display add to the progressive sports car flair in the\n  cockpit. The fully-digital display grouping consists of a 12.3-inch\n  information display and a 14.9-inch control display. These serve as a\n  platform for the BMW iDrive control and operation system, based on\n  BMW Operating System 8.5, which can also be used to digitally operate\n  the climate control functions. In the BMW M2 CS, temperature and\n  ventilation settings, heated seats and the heated steering wheel\n  (if specified) can be controlled either by touch using a special menu\n  option in the lower area of the control display or by voice command\n  with the help of the BMW Intelligent Personal Assistant. M-specific operating concept enables direct access for an\n    extensive range of functions The special-edition model carries over the cutting-edge operating\n  concept for setup customisation from the BMW M2. At the heart is the\n  Setup button on the centre console. This provides direct access to the\n  settings options for the engine, standard adaptive M suspension,\n  M Servotronic steering, integrated braking system working in\n  conjunction with the M Compound brakes, and the M Traction Control\n  function, which allows drivers to set individual intervention\n  thresholds for wheel slip limitation. M Drive Professional makes an\n  ideal companion for journeys fuelled by extra adrenaline. The M mode\n  TRACK and the ten-stage M Traction Control allow customised handling\n  characteristics. The M Drift Analyser shows the angle and duration of\n  drifts executed by the driver, while the M Laptimer is ideal for those\n  striving for the perfect lap. Semi-automated driving and parking systems fitted as standard include\n  front collision warning, Cruise Control with brake function, Speed\n  Limit Info function with no-overtaking indicator, Lane Departure\n  Warning, and the Parking Assistant with Reversing Assistant. Active\n  Cruise Control with Stop&Go function and the Driving Assistant can\n  be added as optional equipment. Fuel consumption and emissions figures:Fuel\n  consumption, combined: 10.0 l/100 km [28.3 mpg imp]; CO2emissions, combined: 226 g/km in the WLTP cycle, CO2class: G. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: BMW Group launches demo fleet for diesel replacement fuels\nContent: Bernhard EdererBMW GroupTel: +49-89-382-28556Fax: +49-89-382-20626send an e-mail Bernhard EdererBMW Group Luxembourg / Munich.The BMW Group is using its\n  presence at the \"Fleet Europe Days\" on 22 and 23 October in\n  Luxembourg to show fleet operators ways to decarbonise their fleets.\n  In addition to fully electrified vehicles, the focus will be on fuels\n  based on renewable raw materials, so-called Carbon Neutral Fuels (CNF). Their advantage: the potential to save CO2. With more than\n  250 million existing vehicles in Europe, their CO2footprint can be improved if the proportion of renewable fuels is\n  increased. A new technical solution used by the BMW Group is proof\n  that all BMW diesels in a fleet are fuelled exclusively with HVO100.\n  Refuelling data from the vehicle is compared with data from the fleet\n  operator's payment system. This means that the fuel used by the\n  vehicle can be traced seamlessly. An important step towards a\n  \"CNF only-fleet\" for fleet customers.Dr. Martin Kaufmann, Head of Powertrain Development at the BMW\n  Group: \"Our goal is always to have more environmentally friendly\n  and efficient vehicles on the road. With the diesel replacement fuel\n  HVO100, we have an opportunity to reduce the CO2footprint\n  of vehicle fleets. Especially in the area of fuels that are not based\n  on fossil fuels, we see a potential that we are ready to realise.” Bernhard Kuhnt, Head of Sales Region Europe, BMW Group:\n  \"Fleet customers are extremely important for sales in Europe and\n  at the same time diesel remains a very good powertrain technology for\n  many fleets. The use of HVO100 offers a way to quickly reduce CO2emissions that takes into account individual use cases - whether\n  driving long distances or towing a trailer - and can thus help our\n  fleet customers reduce their CO2footprint.\" Initial contractual agreements with the operators of large BMW\n  diesel fleets in Germany and Italy are imminent. These test fleets,\n  together with the internal BMW Group fleet that has already been\n  launched, will provide important data and findings for the further\n  improvement of the technical solution.HVO100 used in the first fuelling of all diesel produced in Germany Since January 2025, all diesel models produced in Germany are being\n  fuelled with HVO100 before delivery to dealers. This step underlines\n  BMW's commitment to making decarbonisation possible and achievable\n  today. The abbreviation HVO stands for 'Hydrotreated Vegetable Oil'\n  and the suffix '100' indicates that it is filled with 100 per cent\n  pure fuel. \"Neste MY Renewable Diesel™\" HVO100 is used at the\n  BMW Group plants in Munich, Dingolfing, Regensburg and Leipzig. The fuel from Finnish manufacturer Neste enables a CO2e reduction of\n  up to 90 per cent (\"well to wheel\") compared to fossil\n  diesel. The initial filling at the plants before delivery to the BMW\n  Group dealer organisation is five to eight litres, depending on the model.For the BMW Group, technological openness is a top priority.\n  \"Options instead of bans\" is its motto. The company\n  continues to invest in a broad portfolio - from battery electric\n  vehicles, plug-in hybrids and hydrogen fuel cells to highly efficient\n  combustion engines that can run on renewable fuels. The BMW Group has long approved its vehicles for a variety of\n  regenerative fuels: HVO according to EN15940 as well as B10 and eFuels\n  according to EN590 for diesel engines. In addition, E20/25 and eFuels\n  according to EN228 for petrol engines.Regulatory framework conditions must catch up Regulation must catch up. To accelerate the uptake of renewable fuels\n  across the market, the BMW Group is calling for an ambitious\n  implementation of the Renewable Energy Directive (RED III), including\n  national quotas that require at least a 30% reduction in greenhouse\n  gas emissions from fuels, to be transposed into national law by 2025.Dr. Thomas Becker, Head of Policy, External Relations and\n  Sustainability at the BMW Group, says: \"The BMW Group demands\n  that every measure to reduce CO2emissions is taken into\n  account at every stage of a vehicle's life cycle. This also includes\n  the use of renewable fuels - especially for vehicles that primarily\n  run on CO2-neutral fuel (CNF). These must be formally\n  recognised in EU fleet legislation. The fuels are available, what we\n  need now is a pragmatic and quickly implementable regulation that\n  enables companies to develop innovations and make them marketable.\" Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Specifications of the BMW 5 Series Sedan, valid from 03/2025.\nContent: Nicole FallenbeckBMW GroupTel: +49-89-382-13296send an e-mail Nicole FallenbeckBMW Group Please find attached the specifications of the BMW 5 Series Sedan,\n  valid from 03/2025. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Hypercar line-up 2026: BMW M Motorsport relies on consistency in the cockpits of the four BMW M Hybrid V8s.\nContent: Andrea SchwabBMW GroupTel: +49-89-382-60988send an e-mail Andrea SchwabBMW Group Munich. BMW M Motorsport relies on consistency for the\n    line-ups of its two Hypercar programmes in the FIA World Endurance\n    Championship (FIA WEC) and the IMSA WeatherTech SportsCar\n    Championship (IMSA Series) in 2026. The same eight BMW M works\n    drivers will take the wheel of the four BMW M Hybrid V8s as in 2025.\n    However, there will be a change in the regular driver pairings in\n    the IMSA Series. The eight drivers for BMW M Motorsport’s works programmes in the FIA\n  WEC and IMSA Series in 2026 are once again: Philipp Eng (AUT), Robin\n  Frijns (NED), Kevin Magnussen (DEN), Raffaele Marciello (SUI), René\n  Rast (GER), Sheldon van der Linde (RSA), Dries Vanthoor (BEL), and\n  Marco Wittmann (GER). As in the previous year, Vanthoor and van der\n  Linde will undertake double duty as regular drivers in both race\n  series. Eng and Wittmann will return for another full season in North\n  America, where BMW M Team WRT will take over operations from BMW M\n  Team RLL. Starting in 2026, the Belgian team will compete with the BMW\n  M Hybrid V8 in both the FIA WEC and IMSA Series. In FIA WEC, the driver line-ups for both cars remain unchanged. The\n  #15 BMW M Hybrid V8 will be shared by Magnussen, Marciello, and\n  Vanthoor. In the #20 car, Frijns, Rast, and van der Linde will\n  alternate. In the IMSA Series, there will be a swap in driver\n  pairings. Regular drivers in the #24 BMW M Hybrid V8 will be Vanthoor\n  and van der Linde. They will be supported in endurance races by Frijns\n  and Rast. In the #25 car, Eng and Wittmann will contest the full\n  season together. They will be joined by Magnussen and Marciello for\n  endurance races. Andreas Roos (Head of BMW M Motorsport):“Consistency\n  was our priority when selecting the Hypercar drivers for the 2026\n  season. We are very satisfied with the performance of all eight\n  drivers, and there is no reason to make major changes. With every\n  race, our drivers gain more experience with the BMW M Hybrid V8, which\n  is crucial for the continued progress of our programme. In 2026, we\n  will race with an updated car and a new team in the IMSA Series.\n  That’s enough change, so it was important for us to maintain\n  continuity on the driver side. The key is that everyone works well as\n  a team, pulls together, and advances our LMDh project. That’s exactly\n  what’s happening. I’m very much looking forward to continuing this collaboration.” Hypercar line-ups for 2026 at a glance: FIA WEC, #15 BMW M Hybrid V8:Kevin Magnussen (DEN)Raffaele Marciello (SUI)Dries\n  Vanthoor (BEL) FIA WEC, #20 BMW M Hybrid V8:Robin Frijns (NED)René Rast (GER)Sheldon van der\n  Linde (RSA) IMSA Series, #24 BMW M Hybrid V8:Sheldon van der Linde (RSA)Dries Vanthoor (BEL)Robin\n  Frijns (NED), EnduranceRené Rast (GER), 24h Daytona IMSA Series, #25 BMW M Hybrid V8:Philipp Eng (AUT)Marco Wittmann (GER)Kevin Magnussen\n  (DEN), EnduranceRaffaele Marciello (SUI), 24h Daytona Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: The start of a new era. The new BMW iX3.\nContent: Matthias BodeBMW GroupTel: +49-151-601-61742send an e-mail Matthias BodeBMW Group A defining element of the digital user experience in the new#BMW\n  iX3is BMW Panoramic iDrive, which elevates intuitive operation and\n  the driver focus for which the brand is renowned to a new level. And\n  an all-encompassing sustainability concept reduces the car’s product\n  carbon footprint over its life cycle by more than 30 per cent compared\n  to its predecessor. The first Neue Klasse model will be built at the newly constructed\n  BMW Group plant in Debrecen, Hungary. The first variant of the fully\n  electric SAV to roll off the production line from autumn 2025 will be\n  the BMW iX3 50 xDrive (electric power consumption, combined: 17.9 –\n  15.1 kWh/100 km; CO2class: A; range: 679 – 805 km [421 –\n  500 miles]; provisional figures as per WLTP) with an output of\n  345 kW/469 hp and electric all-wheel drive. Further fully electric\n  variants will follow, including an entry-level model. The market\n  launch of the new BMW iX3 will get underway in Europe in spring 2026\n  and in the USA in summer 2026. Also starting in summer 2026 will be\n  deliveries of a variant of the new BMW iX3 produced at the Shenyang\n  facility that has been tailored specifically to the needs and desires\n  of customers in China. The new BMW iX3 represents a leap forward in development over its\n  predecessor of the same name that extends well beyond the reaches of a\n  conventional model renewal. The advances made in terms of design and\n  technology create the impression that a complete vehicle generation\n  has been skipped. For the BMW Group, the launch of the new BMW iX3\n  also represents a milestone in the transformation process when it\n  comes to electrification, digitalisation and circularity. Spearheading\n  the arrival of the Neue Klasse, it offers customers the latest design\n  and technology innovations, which will shape the brand’s entire model\n  range moving forwards. The technologies of the Neue Klasse will be\n  incorporated into a total of 40 new models and model updates between\n  now and 2027. “The Neue Klasse is our biggest future project and marks a huge leap\n  in terms of technologies, driving experience and design,” says Oliver\n  Zipse, Chairman of the Board of Management of BMW AG. “Practically\n  everything about it is new, yet it is also more BMW than ever. Our\n  entire product range will benefit from the innovations of the Neue\n  Klasse – regardless of the drive technology. What started as a bold\n  vision has now become reality: the BMW iX3 is the first Neue Klasse\n  model to go into series production. We are not only bringing the next\n  generation of one of our most successful fully electric vehicles onto\n  the road, we are launching a new era for BMW.” Launch of the new design language: reduced, characterful and timeless. Major technological advances always offer an opportunity to introduce\n  more significant design changes. The new BMW iX3 will launch the new\n  BMW design language, which will be replicated across the whole of the\n  brand’s model range in due course. This new use of forms provides a\n  very modern interpretation of BMW’s original and enduring blueprint.\n  The design is timeless while also capturing the prevailing zeitgeist.\n  It is reduced to the essence of the BMW brand – and therefore more BMW\n  than ever. For this one reason why comprehensive design protection has\n  been registered for the new BMW design language used in the new BMW iX3. The new BMW iX3 showcases the values and qualities of the Neue Klasse\n  within the template of an SAV. The first BMW X model of the new\n  generation is all about interior space and a progressive lifestyle. At\n  4,782 millimetres in length, 1,895 millimetres wide and\n  1,635 millimetres tall, the new BMW iX3 has the hallmark proportions\n  of an SAV. The characteristic two-box design is infused with the\n  rugged presence of a BMW X model and has precise lines that emphasise\n  all four wheels. Detail optimisation of the car’s aerodynamics enables\n  a drag coefficient (Cd) of 0.24. The load compartment capacity of the new BMW iX3 can be increased\n  from 520 to a maximum 1,750 litres by folding down the rear seat\n  backrest elements as required. The additional storage compartment\n  under the bonnet can hold another 58 litres of cargo. Customers\n  needing additional transportation capacity can specify their car with\n  the optional electric fold-in/fold-out trailer tow hitch. The maximum\n  trailer load of the new BMW iX3 50 xDrive is 2,000 kilograms. The upright front end and clearly formed surfaces endows the new BMW\n  iX3 with considerable presence. The BMW kidneys and twin headlights –\n  both distinctive BMW design cues – take centre stage visually. The\n  sculpted BMW kidneys reference the Neue Klasse of the 1960s in their\n  vertical arrangement. An all-new light signature assumes the role\n  previously performed by chrome in giving the car an aura of quality\n  and sophistication. And when viewed from the side, large surfaces\n  broken up by a small number of precise lines create a character-rich\n  appearance. Flush glass surfaces and door handles are also features of\n  the side view. The robust stature of the new BMW iX3 is underscored by\n  body-colour wheel arches with – in familiar BMW X model style – subtly\n  rectangular contours. The rear end also cuts a powerful and athletic\n  figure. The taillights extending well into the centre of the rear end\n  represent a horizontal interpretation of the signature BMW “L” shape. Interior design: modern space has a BMW-typical driver focus\n    and offers exceptional comfort for all passengers. The design of the BMW iX3 interior sets new standards in terms of\n  modernity and digital experience. The interior has an uncluttered,\n  reduced design, providing the ideal stage for the digital experience.\n  The cabin is all about the clear driver focus for which BMW is\n  renowned and comfort for all those on board. Created specifically for\n  electric vehicles, the vehicle architecture allows for extremely\n  generous levels of space in all five seats. The lines of the\n  “floating” instrument panel flow directly into the large door trim\n  panels, creating an enveloping wrap-around effect for the passengers.\n  With its fabric surface, the instrument panel – with atmospheric\n  backlighting – contributes to the warm and inviting atmosphere inside.\n  Large window surfaces and the optional panoramic sunroof with climate\n  comfort glazing generate an ambience bathed in light. Another prominent influence in the horizontally arranged cockpit is\n  the new control/operation system BMW Panoramic iDrive, which is based\n  on the likewise newly developed BMW Operating System X. It brings\n  together displays, geometry and light & sound design into a\n  holistic experience, customisable via the My Modes. Also playing a\n  role here are the new driving sounds, sound effects and sound signals\n  of the BMW HypersonX soundscape created specifically for the Neue Klasse. The elegantly minimalist seats of the new design stand out with their\n  excellent comfort levels over long journeys, sporty character, and\n  wide range of adjustment. Also sporting an all-new design are the\n  steering wheel and the centre console between the driver’s seat and\n  front passenger seat, complete with storage areas and control\n  elements. The rear seat bench offers a single, sofa-like seat surface. Precisely arranged interior worlds bring a unique and thoroughly\n  distinct character to every equipment package. The materials and\n  colour schemes selected are inspired by modern interior design and\n  advanced Neue Klasse technology, and coordinated harmoniously with one\n  another. They therefore make a noticeable, visible contribution to the\n  exceptional comfort levels on board the new BMW iX3. An attractive\n  range of colours enables a perfect match between the interior tones\n  and exterior paint finishes. As alternatives to the\n  standard-specification Essential interior design in Vivid Grey with\n  Econeer seat coverings, customers can also choose from three other\n  compositions in Veganza, the black BMW M interior world in Veganza and\n  M PerformTex, and the BMW Individual option with a high-quality Merino\n  leather/M PerformTex combination in Black Bicolour or Adelaide Grey. The new BMW iX3 can be specified as an option with the M Sport\n  package or M Sport package Pro from launch. Its dynamic looks are\n  further emphasised by Black high-gloss features for the exterior, and\n  M Sport seats and an M steering wheel inside the car. TheBMW Iconic Glow exterior packageenables an\n  impressive sound and light sequence withRelaxed,BalancedandExcitedstyles. The\n  welcome sequence commences as soon as the driver approaches the\n  vehicle and, as they take their seat, an animated greeting begins in\n  theBMW Panoramic Visionand Central Display,\n  spreading smoothly from the driver’s side of the cockpit to the front\n  passenger side. BMW Panoramic iDrive: consummate driver focus, BMW-style. The BMW iX3 is the first series-produced model in which BMW Panoramic\n  iDrive redefines the user experience and therefore also Sheer Driving\n  Pleasure. With its neatly judged balance between digital functions and\n  physical elements, BMW Panoramic iDrive elevates intuitive operation –\n  according to BMW’s fabled “hands on the wheel, eyes on the road”\n  principle – to a new level of driver focus. The entire system is born\n  out of decades of experience and a user-centric design approach.\n  Individual customer feedback, data from over 10 million connected\n  vehicles and usability studies with more than 3,000 customers were all\n  incorporated into the development process. Physical controls are on\n  hand, including for the windscreen wipers, turn signal indicators,\n  exterior mirrors, volume control, gear selector, parking brake, hazard\n  warning lights, rear window heating and defrost function. Other\n  functions have been optimised for use by touch and voice command or\n  via the multifunction steering wheel. The BMW Intelligent Personal Assistant has been significantly\n  upgraded and now includes two new voices, a new appearance for the BMW\n  Panoramic Vision and additional assistance for the driver through\n  proactive suggestions and personalisable routines. Large Language\n  Model (LLM) technology will also be gradually introduced to enable\n  even more intuitive voice interaction in the future. BMW Panoramic iDrive brings four central elements together into a\n  unique display and control/operation system. The BMW Panoramic Vision\n  projects information across the full width of the windscreen, from\n  A-pillar to A-pillar. The content in the centre and on the front\n  passenger side can be adapted to personal tastes and requirements. Key\n  driving information appears in the driver’s field of vision. And above\n  the BMW Panoramic Vision, the BMW 3D Head-Up Display (if specified)\n  can now also show integrated navigation and automated driving displays\n  on the road with spatial depth. The free-cut-design Central Display\n  with matrix backlight technology is located in an ergonomically ideal\n  position next to the steering wheel. On the driver’s side, vertically\n  arranged widgets enable fast and direct access to particularly\n  frequently used functions using QuickSelect tech.        The new\n  multifunction steering wheel serves as the primary physical control\n  point. Its button panels help the driver and vehicle to work together\n  symbiotically using illuminations, a relief-like surface and haptic feedback. Underpinning BMW Panoramic iDrive is the likewise newly developed BMW\n  Operating System X, which offers extensive scope for personalisation\n  via the BMW ID, intelligent driver assistance, a wide variety of\n  digital functions, extensive connectivity using the My BMW App and\n  outstanding future-proofing thanks to BMW Software Updates. The standard-fit navigation system BMW Maps features an upgrade for\n  the charging-optimised route guidance, plus intelligently coordinated\n  presentation of information on the BMW Panoramic Vision, Central\n  Display and optional 3D Head-Up Display. The BMW Digital Key Plus can\n  be set up on smartphones and smartwatches from all the leading makers,\n  also as standard. Meanwhile, BMW Operating System X unlocks a wide\n  variety of entertainment while on the road and during charging stops,\n  bringing customers not only music streaming apps such as Spotify and\n  in-car gaming with AirConsole, but also a video-streaming app offering\n  Disney+, YouTube and other international/numerous country-specific\n  on-demand and live video platforms. The Zoom App for video calls is\n  now also available for use. The BMW ConnectedDrive Store provides an overview of the features\n  customers can currently download or access, and these can be added\n  easily and flexibly through ConnectedDrive Upgrades. For example, more\n  than 60 third-party apps in the music & audio, entertainment,\n  gaming, news, and travel & local categories are available\n  worldwide. To download the features and use the apps, customers will\n  need access to connectivity via BMW Digital Premium or a WiFi\n  network/smartphone hotspot. The BMW Digital Premium range of features\n  customers can add as they desire comprises extensive safety functions,\n  extended navigation features, unlimited data for entertainment and now\n  also BMW M Apps. Sixth-generation BMW eDrive technology: higher efficiency,\n    more range, faster charging. The sixth-generation BMW eDrive technology developed for the Neue\n  Klasse comprises highly efficient electric motors, fundamentally new\n  high-voltage batteries with cylindrical cells, and 800V technology.\n  The BMW iX3 50 xDrive is powered by two electric motors, which\n  together generate output of 345 kW/469 hp and 645 Nm (475 lb-ft) of\n  torque. It accelerates from 0 to 100 km/h (62 mph) in 4.9 seconds and\n  reaches a top speed of 210 km/h (130 mph). Its electric\n  all-wheel-drive configuration consists of an extensively upgraded\n  electrically excited synchronous motor (EESM) with particularly high\n  levels of efficiency at the rear axle and, at the front axle, a new\n  asynchronous motor (ASM) distinguished by its compact design and high\n  cost efficiency. The combination of EESM and ASM is evidence of the\n  BMW Group’s commitment to technological neutrality within electric\n  mobility as well. The drive technology developed for the Neue Klasse\n  reduces energy losses by 40 per cent compared to fifth-generation BMW\n  eDrive technology, weight by 10 per cent and manufacturing costs by 20\n  per cent. The new high-voltage battery concept with cylindrical cells for the\n  Neue Klasse also achieves significant advances. The energy density on\n  a cell level is 20 per cent higher than with fifth-generation BMW\n  eDrive technology, and the new concept also paves the way for a 30 per\n  cent increase in charging speed. The cylindrical cells are integrated\n  directly into the high-voltage battery (“cell to pack”), which\n  benefits energy density and cost efficiency. Added to which, the\n  high-voltage battery is integrated into the vehicle architecture as a\n  structural component to minimise weight (“pack to open body”). The\n  high-voltage battery in the BMW iX3 50 xDrive has a usable energy\n  content of 108.7 kWh, enabling a range of up to 805 kilometres (500\n  miles) in the WLTP cycle. BMW Charging: short charging times, premiere for bidirectional charging. The advances brought by sixth-generation BMW eDrive technology have a\n  significant influence on the charging experience, too. A maximum\n  charging rate of 400 kW enables users to fill their new BMW iX3 with\n  enough energy at an 800V direct current (DC) rapid charging station to\n  add up to 372 kilometres (231 miles)[1]of range in just ten minutes. The high-voltage\n  battery can charge from 10 to 80 per cent capacity in 21 minutes.\n  Thanks to the battery management tech with integrated switching matrix\n  developed completely in-house by the BMW Group, the new BMW iX3 can\n  also be charged from 400V DC stations. Upgrades to the battery\n  preparation also help to shorten charging times. The new\n  BMW iX3 50 xDrive can top up on alternating current (AC) at 11 kW as\n  standard or 22 kW[2]as\n  an option. Extensive bidirectional charging functions[3]are also available for the new BMW\n  iX3, meaning that it can be used as an energy supply source for a\n  variety of applications. The Vehicle-to-Load (V2L) function turns the\n  new BMW iX3 into a mobile powerbank, which can supply electric devices\n  with power while on the move. Vehicle-to-Home (V2H) hands it the role\n  of storage unit for solar energy generated by home-fitted photovoltaic\n  systems. And customers can also hook their car up to the energy market\n  via the Vehicle-to-Grid (V2G) application and earn some money in the process. The selection of standard-fitted and optional charging accessories\n  has been significantly expanded. For flexible charging during a\n  journey, customers can make use of the new Multifunction Charger,\n  which comes with several adapters for charging and discharging the\n  high-voltage battery. The new BMW Wallbox Professional (DC) enables\n  bidirectional charging at home or work. And BMW Charging offers the\n  option of cost-optimised /solar-power-optimised home charging.\n  Emblematic of the charging experience in this new vehicle generation\n  is the intelligent charging flap of the new BMW iX3, which uses\n  artificial intelligence (AI) to detect the customer’s intention to top\n  up their car and then automatically opens or closes. And\n  sixth-generation BMW eDrive technology makes it possible to view the\n  current charging speed and curve in the My BMW App. Up to ten\n  individual charging contracts from various suppliers can be shown\n  digitally inside the new BMW iX3, enabling use of the Plug &\n  Charge Multi Contract function. Heart of Joy: Sheer Driving Pleasure reaches a new level. One of four “superbrains” in the electronics architecture of the Neue\n  Klasse, the Heart of Joy looks after drivetrain and driving dynamics\n  management. This high-performance control unit is responsible for the\n  drivetrain, brakes, energy recuperation and steering subfunctions, and\n  processes information up to ten times faster than conventional control\n  units. In this way, the potential of electric mobility in terms of\n  instantaneous power delivery, smooth power transfer, agility,\n  stability and efficiency is utilised to the full. Together with the BMW Dynamic Performance Control software stack\n  developed fully in-house, the Heart of Joy calculates all the driving\n  dynamics parameters with a new level of speed and precision. Here, the\n  decades of experience of BMW in the field of driving dynamics control\n  come to the fore. The driver and passengers in the new BMW iX3\n  experience a uniquely harmonious and BMW-typical driving feeling\n  whatever the situation and speed. Every movement of the accelerator,\n  brake pedal and steering is executed directly and with assurance and\n  precision. Supreme traction and – thanks to the unique Soft Stop\n  function – the smoothest stopping process ever achieved by a BMW are\n  among its other attributes. In addition, the efficiency of the new BMW\n  iX3 is optimised by the integrated management of drivetrain, braking\n  system and energy recuperation. In everyday driving, 98 per cent of\n  braking manoeuvres are carried out using recuperation only, i.e.\n  without application of the friction brakes. “Superbrain of automated driving” for the driver assistance\n    systems with new-generation technology. Another high-performance computer brings together all the automated\n  driving and parking functions in the BMW iX3. With 20 times greater\n  processing power than conventional control units, the “superbrain of\n  automated driving” enables a significant technological advance with\n  the Neue Klasse in this area as well. BMW Symbiotic Drive provides seamless support.The BMW iX3 uses its Symbiotic Drive capability combined with\n  driver assistance to create a completely new driving experience.\n  Whenever the driver wants to accelerate, brake or steer, their inputs\n  merge seamlessly and intuitively with AI-enabled software. The result is a whole new form of Sheer Driving Pleasure. These\n  driver assistance functions are generally already included as standard\n  with entry-level specification. For example, the automatic cruise\n  control system is not deactivated with only a light press of the brake\n  pedal; instead, it is only switched off when the driver brakes harder.\n  In the same way, the lane control assistance remains active even after\n  a small steering input by the driver. The further-developed BMW motorway assistant supports BMW iX3 drivers\n  from the moment they join a motorway until they leave it, and allows\n  them to take their hands off the steering wheel for long periods. The\n  functionality offered by the City Assistant includes traffic light\n  detection, where the car automatically stops and then moves off again. New electronics architecture with four “superbrains”. The completely newly developed electronics architecture comprises a\n  total of four high-performance computers known as “superbrains”. They\n  pool their processing power for driving dynamics, automated driving,\n  infotainment and basic & comfort-enhancing functions. They also\n  provide the basis for a new software architecture that can be\n  continuously upgraded and is therefore designed to incorporate\n  upcoming function updates including AI features. The new digital nervous system consists of a wiring harness divided\n  into four zones. This reduces weight by 30 per cent compared to the\n  technology used previously and allows for around 600 metres less\n  wiring. Another new feature are digital “smart eFuses”, which replace\n  classical safety fuses. They enable intelligent power modes for\n  different vehicle states that help to improve the car’s overall efficiency. With its four superbrains and highly connected software platforms,\n  the BMW iX3 is a true software-defined vehicle and exceptionally well\n  equipped for the future. Added to which, the new electronics\n  architecture forms the basis for multifaceted improvements in the\n  networking of the BMW iX3 with the My BMW App. This new level of\n  quality when it comes to integration delivers new experiences and\n  holds considerable potential for future innovations. Equipment and individualisation to enhance driving pleasure,\n    comfort and versatility. The new BMW iX3 will be available with one solid and five metallic\n  paint finishes from launch. As an alternative to the 20-inch\n  light-alloy wheels fitted as standard, customers can also browse an\n  exclusive selection of new light-alloy wheels (20-, 21- and 22-inch)\n  available as an option. The range also includes BMW M and BMW\n  Individual light-alloy wheels, some in aerodynamically and\n  weight-optimised Air Performance specification. Customers can tailor the design of the cabin to their personal style\n  with the help of the Essential, Contemporary, M Sport and BMW\n  Individual interior design worlds. The driver’s seat and front\n  passenger seat are heated and electrically adjustable as standard. M\n  Sport seats and multifunction seats are available as options. Also on\n  the options list are a sports steering wheel and an M Sport steering wheel. Standard specification for the new BMW iX3 50 xDrive also includes\n  two-zone automatic climate control, Comfort Access, automatic tailgate\n  operation, the extended exterior mirror package, an alarm system and\n  the telephony with wireless charging function. Among the other\n  highlights of the optional equipment offering are three-zone automatic\n  climate control, adaptive headlight functions with intelligent light\n  control, the BMW Iconic Glow package including illuminated BMW\n  kidneys, the Harman Kardon HiFi system with 13 speakers, steering\n  wheel heating and a large panoramic sunroof, whose climate comfort\n  glazing has unique solar energy filtering and 100-per cent UV protection. Holistic sustainability approach targeting circularity and\n    CO2e reduction . The BMW Group kicked off the development of its upcoming vehicle\n  generation by intensifying its efforts to systematically implement\n  “Design for Circularity” principles and further reduce CO2e\n  emissions throughout the product life cycle. A holistic sustainability\n  approach has therefore been applied for the new BMW iX3. A variety of measures ensures that the product carbon footprint of\n  the new BMW iX3 50 xDrive over its full life cycle – based on a\n  mileage of 200,000 kilometres (124,260 miles) – is 34 per cent smaller\n  than that of its predecessor. This means that, when charged with\n  electricity from the European energy mix, it has a smaller product\n  carbon footprint than a comparable combustion-engined (ICE) model\n  after around 21,500 kilometres (13,358 miles). When charged\n  exclusively with electricity from renewable sources, the BMW iX3 50\n  xDrive beats the comparable ICE model after only 17,500 kilometres\n  (10,873 miles, WLTP combined), allowing customers to potentially\n  achieve CO₂e advantages over the ICE model in as little as one year. Around one third of the new BMW iX3 is made from secondary raw\n  materials. For example, the storage compartment under the front hatch\n  and the engine compartment cover are made from 30 per cent[4]recycled marine\n  plastic. The base material of the yarn for the Econeer seat textile,\n  the headliner (textile) and the floor-mat carpet is made from 100 per\n    cent[5]recycled PET.\n  When it comes to the car’s chassis, aluminium consisting of 80 per\n  cent secondary raw material is used for the swivel bearings and hub\n  carriers, while the wheel rims are cast from aluminium with a 70 per\n  cent secondary raw material content. The overall product carbon footprint of the supply chain for the BMW\n  iX3 50 xDrive has been reduced by 35 per cent. Production and\n  operations at BMW Group Plant Debrecen do not use fossil fuels in\n  normal operating conditions. And thanks to sixth-generation BMW eDrive\n  technology and other BMW EfficientDynamics measures,  the energy\n  consumption of the new BMW iX3 is 20 per cent lower than that of the\n  predecessor model (WLTP combined). The BMW Group's new corporate website provides an overview of all key\n  company topics and consolidates various aspects of the journey toward\n  the Neue Klasse. It offers extensive information on the development of\n  the latest model generation, highlights historic milestones of the\n  Neue Klasse, and features details about the innovative technologies of\n  the new BMW iX3, available here:https://www.bmwgroup.com/en/company/neue-klasse.html.\n  Additionally, starting September 6, 2025, a four-part documentary film\n  about the Neue Klasse will be released on the corporate website,\n  offering an in-depth look into the company's significant transformation. [1]The added range\n      after ten minutes of high-power charging was determined in\n      accordance with ISO12906 in the WLTP cycle. This and the charging\n      performance depend on the vehicle specification, battery charge,\n      condition and temperature, individual driving profile, use of\n      auxiliary consumers, ambient temperature and the charging power\n      provided by the charging point. [2]Available from\n      production period 3/2026. [3]Available from\n      production period 3/2026. [4]The stated\n      proportion of recycled material in per cent refers to the base\n      polymer without taking into account the additives and fillers\n      contained in the material. [5]The stated\n      proportion of recycled material in per cent refers to the base\n      polymer without taking into account the additives and fillers\n      contained in the material. [6]The stated\n      proportion of recycled material in per cent refers to the base\n      polymer without taking into account the additives and fillers\n      contained in the material. WLTP energy consumption combined: 17,9 - 15,1 kWh/100 km; WLTP CO₂\n  emissions combined: 0 g/km; CO2-class: A; WLTP electric range: 679 -\n  805 km. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: BMW Group sets new climate target for 2035: At least 60 million tons of CO2e savings compared to 2019 – another milestone on the road to net zero\nContent: Isabel RichterBMW GroupTel: +4915160153189send an e-mail Isabel RichterBMW Group Munich, 2 December 2025.The BMW Group has defined a\n  new 2035 milestone for cutting CO2e emissions on the road\n  to net zero. The company aims to reduce its CO2e emissions\n  by at least 60 million metric tons compared to 2019 levels, an\n  additional reduction of approximately 20 million tons of\n  CO2e beyond the existing 2030 target. In doing so, the BMW Group is pursuing a comprehensive\n  decarbonization strategy along the entire life cycle, with the goal of\n  achieving net zero by 2050 at the latest. This represents a firm\n  commitment to the goals set out in the Paris Agreement. To date, the\n  target has been to cut at least 40 million metric tons of\n  CO2e across the entire life cycle (scopes 1, 2 and 3) by\n  2030 compared to 2019 levels. The new 2035 milestone is a logical next\n  step on this road toward advancing decarbonization. At the same time,\n  the climate impact of the BMW Group’s business model will also be\n  drastically reduced. By 2035, each euro generated will see less than\n  half as much CO2e emitted compared to 2019. The key measures for achieving these results include the increasing\n  use of renewable energies in production and the supply chain, the\n  increased utilization of secondary raw materials, efficiency\n  improvements in the use phase, as well as product and process\n  innovations. The latter are being implemented across all drive\n  variants as part of the BMW Group’s technology-neutral approach. In\n  addition, an increasing proportion of the vehicle fleet will continue\n  to be electrified. Decarbonization along the entire life cycle The BMW Group has intentionally set itself the additional 2035\n  milestone to consistently advance its decarbonization strategy. Global\n  customer demand for electric vehicles alone will not be sufficient to\n  achieve the CO2e targets set for 2030 and 2035. The\n  comprehensive approach to reducing CO2e emissions therefore\n  spans the entire vehicle life cycle, irrespective of the drive variant. In the supply chain, which is increasingly relevant in terms of\n  CO2e emissions, especially for electric models, the company\n  focuses on expanding the use of secondary raw materials and renewable\n  energies. The specific priorities are highly CO2e-emitting\n  components such as high-voltage batteries, aluminum, and steel. In\n  addition, the company will be implementing product and process\n  innovations, such as in the BMW Group’s sixth generation (Gen6) of\n  battery technology. The BMW Group also applies high standards in production: for example,\n  since 2020, all electricity sourced from external suppliers for all\n  plants worldwide has come exclusively from renewable sources. The BMW\n  Group also works continuously on replacing fossil fuels. The new plant\n  in Debrecen, Hungary, is the BMW Group’s first car factory to produce\n  vehicles without any fossil fuels such as oil and gas in standard operation. To lower CO2e emissions during the use phase, the BMW\n  Group is implementing additional efficiency measures such as BMW\n  EfficientDynamics, in addition to electrifying its vehicle fleet. As a\n  result, efficiency potential in all vehicle subsystems, such as the\n  drive system, tires, and aerodynamics, is consistently identified and\n  implemented, regardless of the drive technology. The new BMW iX3, for\n  instance, uses up to 20% less energy (WLTP combined) than its predecessor. Reaching the new milestone will also depend on a variety of external\n  factors, such as the transformation of the steel industry in favor of\n  more CO2e-reduced steel, the expansion of the charging\n  infrastructure, progress in the circular economy, and the advancement\n  of battery cell technologies. This is why the BMW Group continues to\n  pursue a number of strategic initiatives, such as the ongoing\n  expansion of in-house expertise in state-of-the-art battery cell\n  centers of excellence and innovative circular economy projects. Further  information: Sustainability\n    in the iX3 Battery Competence Center Recycling and Dismantling Centre If you have any questions, please contact: BMW Group, Presse- und Öffentlichkeitsarbeit Teamlead Sustainability Communication BMW Group Telefon: +49-151-601-53189 E-Mail: Isabel.Richter@bmwgroup.com Internet:www.press.bmwgroup.com/deutschland E-Mail: presse@bmwgroup.com With its four brands BMW, MINI, Rolls-Royce and BMW Motorrad, the BMW\n  Group is the world’s leading premium manufacturer of automobiles and\n  motorcycles and also provides premium financial services. The BMW\n  Group production network comprises over 30 production sites worldwide;\n  the company has a global sales network in more than 140 countries. In 2024, the BMW Group sold over 2.45 million passenger vehicles and\n  more than 210,000 motorcycles worldwide. The profit before tax in the\n  financial year 2024 was € 11.0 billion on revenues amounting to €\n  142.4 billion. As of 31 December 2024, the BMW Group had a workforce\n  of 159,104 employees. The economic success of the BMW Group has always been based on\n  long-term thinking and responsible action. Sustainability is a key\n  element of the BMW Group’s corporate strategy and covers all products\n  from the supply chain and production to the end of their useful life. LinkedIn:http://www.linkedin.com/company/bmw-group/ YouTube:https://www.youtube.com/bmwgroup Instagram:https://www.instagram.com/bmwgroup Facebook:https://www.facebook.com/bmwgroup X:https://www.x.com/bmwgroup Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: Stefan Hienzsch takes over as Head of BMW Bank\nContent: Lennart WermkeBMW GroupTel: +49-151-601-980-96send an e-mail Lennart WermkeBMW Group Munich.BMW Bank GmbH is\n  strengthening its profile on the path to becoming a digitalized bank\n  with high innovation standards: Stefan Hienzsch has been appointed as\n  the new Chairman of the Board of Management with effect from 1\n  December. As one of Germany's leading automotive banks, the credit\n  institution is further enhancing its management board in an\n  increasingly complex regulatory environment. Hienzsch, a fully\n  qualified lawyer, has already been Chief Representative of BMW Bank\n  since June 2024. The management board remains unchanged, with Joachim\n  Herr, Torsten Matheis and Kerstin Zerbst continuing in their roles.\"Stefan Hienzsch is an experienced financial and legal\n  expert who is very familiar with the challenges and opportunities of\n  the BMW Group's financial services business. Under his leadership, BMW\n  Bank will continue to expand its role as a reliable, innovative\n  partner for our customers and dealers and continue to make a\n  significant contribution to the success of the BMW Group in Germany\n  and Europe,\" said Alexander Buresch, Chairman of the Supervisory\n  Board of BMW Bank and Head of BMW Group Financial Services.Hienzsch has more than 25 years of experience within the\n  company. Previously, he headed the BMW Group's legal department for\n  Corporate Finance, Financial Services and Mergers & Acquisitions\n  for over a decade and held various leadership roles in the UK for the\n  BMW, MINI and Rolls-Royce brands.\"I am very pleased about the trust placed in me and look\n  forward to my new role. BMW Bank will continue to systematically\n  pursue its digital transformation process. My goal is to inspire\n  customers and retailers with innovative, digital and sustainable\n  solutions and to further develop the bank as a strong, future-oriented\n  partner in the BMW Group ecosystem,\" says Stefan Hienzsch.Information for editors BMW Bank GmbH is one of the leading automotive banks in Germany\n    with subsidiaries in Italy, Spain and Portugal. More than 1,170\n    employees serve around one million customers (as of December 31,\n    2024). The product range extends from financing, leasing and\n    insurance for cars and motorcycles to deposit products and credit cards.The company has total assets of 28.5 billion euros) and deposits\n    of around 11.9 billion euros (both as of December 31, 2024). BMW\n    Bank GmbH is part of BMW Group Financial Services. Almost every\n    second new BMW and MINI vehicle is financed or leased through BMW\n    Group Financial Services.For queries, please contact:BMW GroupCorporate CommunicationsLennart Wermke, Communication BMW Group Financial\n  ServicesTelephone: +49 151 601 980 96E-Mail:lennart.wermke@bmwgroup.comMax-Morten Borgmann, Head of Communication Corporate, Finance,\n  SalesTelephone: +49 151 601 24 118E-Mail:max-morten.borgmann@bmwgroup.comInternet:www.press.bmwgroup.com/deutschlandE-Mail:presse@bmwgroup.comThe BMW GroupWith its four brands BMW, MINI, Rolls-Royce and BMW\n  Motorrad, the BMW Group is the world’s leading premium manufacturer of\n  automobiles and motorcycles and also provides premium financial\n  services. The BMW Group production network comprises over 30\n  production sites worldwide; the company has a global sales network in\n  more than 140 countries.In 2024, the BMW Group sold over 2.45 million passenger vehicles\n  and more than 210,000 motorcycles worldwide. The profit before tax in\n  the financial year 2024 was €11.0 billion on revenues amounting to\n  €142.4 billion. As of 31 December 2024, the BMW Group had a workforce\n  of 159,104 employees.The economic success of the BMW Group has always been based on\n  long-term thinking and responsible action. Sustainability is a key\n  element of the BMW Group’s corporate strategy and covers all products\n  from the supply chain and production to the end of their useful life.LinkedIn:http://www.linkedin.com/company/bmw-group/ YouTube:https://www.youtube.com/bmwgroup Instagram:https://www.instagram.com/bmwgroup Facebook:https://www.facebook.com/bmwgroup X:https://www.x.com/bmwgroup Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  },
  {
    "text": "Title: BMW Motorrad presents the BMW F 450 GS.\nContent: Juliane DreslerBMW GroupTel: +49-151-601-95733send an e-mail Juliane DreslerBMW Group \"With the new BMW F 450 GS, BMW Motorrad presents a\n    genuine BMW GS in the48 hp A2 class. It embodies\n    the essence of a GS: Get on, twist the throttle, have fun - with\n    full control and maximum confidence.Its low weight, superior performance and perfect balance\n    between agility and stability ensure a particularly intuitive riding\n    experience. Thanks to its precise handling and typical GS expertise,\n    it performs impressively both on and off the road. The F 450 GS is\n    the perfect'best buddy' for every riding\n    situation. It is uncomplicated, robust, and always ready. It sets\n    the benchmark for sporty adventure bikes in its class.\"Markus Flasch, CEO BMW Motorrad The new BMW F 450 GS: BMW GS expertise in the 48 hp A2 class\n    in the iconicBMW GS design.The new BMW F 450 GS marks the next step in the\n  GS model family, specifically addressing the 48 hp A2 class with\n  proven GS technology and iconic design. At the EICMA international motorcycle show, BMW Motorrad gave a\n  preview of a fully-fledged GS model already in 2024, which\n  specifically addresses the steadily growing market segment of\n  medium-sized displacement motorcycles. The series version of the BMW F 450 GS consistently lives up to this\n  claim: It is a versatile all-rounder that combines everyday usability,\n  sporty dynamic performance, touring comfort, and off-road\n  capabilities. In the \"GS Trophy\" equipment variant, it\n  follows in the footsteps of the concept vehicle. It adopts its\n  striking design language and high-quality, high-tech components,\n  including magnesium parts for maximum performance and low weight. With its balanced power-to-torque ratio, low weight, and\n  characteristic GS ergonomics, the F 450 GS provides riding fun and\n  confidence from the first meter. The new F 450 GS thus combines the\n  classic GS spirit with a modern, accessible, and simultaneously\n  powerful approach. \"With the BMW F 450 GS, we are addressing a particularly broad\n  target audience. This motorcycle is aimed at anyone who values\n  ​​maximum agility, versatility, pure riding pleasure, and cutting-edge\n  technology – regardless of whether they are on the road every day, on\n  long tours, or simply looking for a light, dynamic, and uncomplicated\n  bike. The current trend toward downsizing, i.e., switching from heavy\n  motorcycles to compact and versatile machines, demonstrates the great\n  interest in this segment. The F 450 GS offers the ideal combination of\n  playful handling, maneuverability, riding dynamics, and high-quality\n  equipment – ​​without compromising on quality or technical\n    performance.”Astrid Neudecker, Product Manager BMW\n  F 450 GS The BMW Easy Ride Clutch (ERC) is a technical highlight and a further\n  development of a centrifugal clutch. This system eliminates the need\n  to manually operate the clutch lever while riding. This applies to all\n  situations, from starting off and changing gears to demanding off-road\n  maneuvers. BMW Motorrad is setting a new standard in this vehicle class. A range of attractive options will be added at the time of market\n  launch: The F 450 GS can be equipped with an Akrapovic end muffler and\n  original BMW Motorrad cross-spoke wheels on request. The result is a\n  package that combines sporty dynamic performance, technical innovation\n  and GS DNA perfectly. Performance developed from scratch: A confident companion for\n    both road andoff-road riding.The completely redesigned BMW F 450 GS is a\n  sporty adventure bike that complements the current BMW Motorrad model\n  portfolio, with developers focusing on excellent handling\n  characteristics, strong performance, durability, and optimum accessibility. The design focuses on the consistent implementation of the current GS\n  design language. With iconic features such as the LED headlight with\n  \"X\" daytime riding light and the distinctive flyline, the\n  bike's affiliation with the BMW Motorrad GS family is clear at first glance. Completely redesigned, smooth-running and characterful\n    two-cylinder in-line engine with 135-degree crankpin offset for\n    dynamic riding pleasure on asphalt and off-road.At the heart of the new BMW F 450 GS is a\n  completely newly developed two-cylinder in-line engine with fuel\n  injection and a stainless steel exhaust system on the right-hand side.\n  The new F 450 GS impresses with its powerful performance and pulling\n  power, delivering a power output of 35 kW (48 hp) at 8,750 rpm and a\n  maximum torque of 43 Nm at6,750 rpm.Thanks to\n  the use of high-tech materials and optimized internal friction, these\n  performance values are achieved with exactly 420 cm³. This makes the\n  engine one of the most compact and powerful in the A2 two-cylinder\n  segment. It not only meets the strict EU5+ requirements but is also\n  particularly economical, consuming just 3.8 liters per 100 km. A range\n  of over 350 km can be achieved in conjunction with the 14-liter tank.\n  The maintenance interval is the standard 10,000 km for BMW motorcycles. Unique on the motorcycle market, the engine features a crankshaft\n  with crankpins offset by 135 degrees and, in conjunction with a single\n  balance shaft, sets a technical exclamation mark: this design ensures\n  a characterful, emotional ride while simultaneously reducing unwanted\n  vibrations to an exceptionally low level. Easy Ride Clutch (ERC) for a significant increase in dynamics,\n    operating comfort, and riding comfort.A\n  technical highlight of the new BMW F 450 GS is the Easy Ride Clutch\n  (ERC). Its core is a precision centrifugal unit in the clutch, which\n  engages the clutch depending on engine speed. This system is standard on the GS Trophy variant and available as an\n  optional accessory for all other model variants. In combination with\n  the Shift Assistant Pro, manual operation of the clutch lever is\n  completely eliminated – from starting off and gear changes to\n  demanding maneuvers. The clutch lever, however, remains intact and allows the rider to\n  intervene manually at any time if necessary – for example, to lift the\n  front wheel over an obstacle or to improve control when descending on\n  slippery surfaces. Technologically, the ERC is based on an advanced centrifugal clutch.\n  Unlike conventional systems, it remains closed during overrun. This\n  creates natural, familiar, and predictable handling at all times –\n  comparable to a conventional clutch. The engine brake remains fully\n  active until just before a stop; only when the idle speed is reached\n  does the ERC automatically open, reliably preventing the engine from stalling. The system ensures greater dynamics, control, and comfort – whether\n  maneuvering, in city traffic, on winding roads, or off-road. Six-speed transmission and left-mounted secondary drive. Shift\n    Assistant Pro for quick upshifts and downshifts without clutch\n      operation.The likewise newly designed\n  six-speed transmission transmits torque to the left-hand secondary\n  drive via an X-ring chain.For fast upshifts and downshifts\n  without clutch operation, the new F 450 GS is offered with Shift\n  Assistant Pro in all equipment variants except the basic variant. This\n  can be retrofitted to the basic version. \"Rain,\" \"Road,\" and \"Enduro\"\n    riding modes, as well as ABS Pro, DBC, DTC, and MSR (engine drag\n    control), are standard features for a high level of riding enjoyment\n    and safety. An additional \"Enduro Pro\" riding mode is\n    available starting with the Exclusive trim variant.The BMW F 450 GS offers three riding modes as\n  standard: \"Rain\", \"Road\" and \"Enduro\",\n  allowing the motorcycle to be adapted to suit individual preferences.\n  Standard equipment also includes ABS Pro, Dynamic Brake Control (DBC),\n  Dynamic Traction Control (DTC) and engine drag torque control (MSR). The additional “Enduro Pro” mode, which is used from the Exclusive\n  equipment variant onwards, is designed for off-road use with\n  coarse-tread off-road tires and allows the ABS on the rear wheel to be deactivated. Newly developed chassis with tubular steel frame for optimal\n    rigidity, robustness, and driving precision. Short wheelbase for\n    agile and playful handling.The new BMW F\n  450 GS also features a completely new chassis concept. Playful\n  handling, optimum accessibility, high riding precision and riding\n  stability were the developers' top priorities. The specially developed\n  lattice-tube frame of theBMW F 450 GS consists of\n  welded steel tubes and forged parts. The frame integrates the\n  two-cylinder in-line engine as a supporting element and is designed to\n  be lightweight yet robust. The front wheel is guided via KYB upside-down telescopic\n    forks, while the rear wheel is guided via an aluminum hollow cast\n    double armed swinging arm with a KYB central spring strut featuring\n    progressive damping.Front wheel control\n  is provided by a torsionally rigid KYB upside-down telescopic fork\n  with a 43 mm inner tube diameter. The Sport and GS Trophy variants\n  feature the so-called \"sports suspension.\" The fork is\n  adjustable for rebound and compression damping. Rear wheel control is\n  provided by a closed, and therefore extremely torsionally rigid, yet\n  lightweight, hollow-cast aluminum double-sided swing arm, coupled with\n  a directly connected KYB central spring strut (adjustable spring\n  preload and rebound damping) with travel-dependent damping derived\n  from rally racing, a unique feature in this segment. Wheels and tires tailored to the typical BMW GS\n      applications.The new BMW F 450 GS\n  features lightweight yet robust cast aluminum wheels. It is fitted\n  with tubeless tires for road and off-road use, sized 100/90-19 at the\n  front and130/80-17 at the rear. Additionally, the\n  Original BMW Motorrad Accessories range offers cross-spoke wheels. A powerful braking system combined with BMW Motorrad ABS Pro\n    ensures safe braking even when leaning. Dynamic Brake Control (DBC)\n    and Dynamic Brake Light are additional safety features.The front wheel of the new BMW F 450 GS\n  features a floating single-disc brake with a Brembo 4-piston fixed\n  caliper and a 310 mm brake disc diameter for superior, stable\n  deceleration. A single disc brake with 1-piston floating caliper and\n  240 mm diameter is used on the rear wheel. The new BMW F 450 GS already comes standard with BMW Motorrad ABS\n  Pro. ABS Pro also offers increased safety when braking in curves by\n  enabling ABS-assisted braking while leaning. Dynamic Brake Control\n  (DBC) offers increased safety when braking, even in difficult\n  situations, by preventing unintentional throttle application. The\n  dynamic brake light effectively alerts following vehicles to the\n  braking motorcycle ahead. Optimal ergonomics and equipment for comfortable, playful, and\n    agile motorcycling on and off-road.A\n  sophisticated ergonomic triangle and a high, close-to-the-body\n  handlebar made of tapered aluminum tubing ensure an ideal riding\n  position in all conditions. The body and the 14-liter fuel tank below\n  it are designed for optimal support and good knee contact, both when\n  seated and while standing off-road. A wide range of accessories are\n  available to meet the individual needs of riders, including a\n  handlebar riser, a rally seat, and the option of a low seat. Three different seat variants, adjustable hand levers, a\n    handlebar riser, and secure footrests with height-adjustable\n    gearshift and footbrake levers ensure optimal riding comfort both on\n    and off-road.The new BMW F 450 GS comes\n  with a two-part seat (845 mm) as standard. The low Black rider's seat\n  (830 mm) and the high Rallye seat in Black/White/Red (865 mm),\n  available as part of the Original BMW Motorrad Accessories, can be\n  adapted to individual requirements. The standard adjustable handlebar\n  levers and the optional 20 mm handlebar risers made of high-strength\n  anodized silver aluminum offer further adjustment options. The new BMW F 450 GS comes standard with a footrest system with\n  removable rubber grips, whose serrated profile makes it suitable for\n  off-road use. A very practical feature is the easy height adjustment\n  of the foot brake lever by 20 mm in two positions to suit individual\n  needs for on- and off-road riding. The gearshift lever is also height-adjustable. Wider enduro footrests are included starting with the Exclusive\n  version or are available as optional accessories. High touring and everyday performance thanks to sophisticated\n    vehicle and weather protection, as well as a comprehensive storage\n      concept.The modular design of the\n  available windshields (optional accessories) allows for individual\n  customization. Depending on the intended use and personal preference,\n  you can choose between the high Tour windshield (height-adjustable)\n  and the clear or tinted Rally windshield. This allows the comfort and\n  wind and weather protection of the new BMW F 450 GS to be tailored\n  specifically to individual needs. In the event of a fall or tip-over, Original BMW Motorrad Accessories\n  offer effective ways to protect your motorcycle from damage, including\n  engine guards, engine protection bars, front axle protectors, and\n  other protective components. The diverse range of special accessories – whether side bags, tail\n  bags, luggage rolls, tank bags, luggage racks, or top cases – offers\n  maximum flexibility for every application. Powerful LED light units as standard. Connectivity featuring a\n    large, perfectly readable 6.5-inch TFT display that provides\n    comprehensive information and functionality. Practical USB-C socket\n    in the cockpit area.The new BMW F 450 GS\n  features an LED headlight with an iconic \"X\" daytime riding\n  light signature as standard. The turn indicator and control lamps of\n  the F 450 GS also use LED technology. A large 6.5-inch TFT display is also standard on the new BMW F 450\n  GS. The variety of information, display quality, and, last but not\n  least, user-friendliness are premium. It comes standard with screen\n  displays tailored to the BMW GS world: the Pure Ride Screen and the\n  Sport Screen with detailed information on DTC, braking force, and lean\n  angle. Taking phone calls, listening to music, and navigation while\n  riding is also possible. Four attractive equipment variants for the new BMW F 450\n      GS.The new BMW F 450 GS is available in\n  four equipment variants: theBMW F 450 GS Basismodel in Cosmic Black and theBMW F 450 GS Exclusive, also in Cosmic Black, with\n  off-road footrests, handguards, a plastic underbody guard, Riding\n  Modes Pro, Shift Assistant Pro, and a clear windshield. Another equipment variant is theBMW F 450 GS Sportin Racing Red, featuring off-road footrests, handguards, a plastic\n  underbody protection, Riding Modes Pro, Shift Assistant Pro, a clear\n  windshield, and the “sports suspension” (with KYB fork adjustable in\n  rebound and compression). The fourth variant, theBMW F 450 GS\n  Trophyin Racing Blue Metallic, tops the lineup. It features\n  off-road footrests, white handguards, Riding Modes Pro, Shift\n  Assistant Pro, “Sports Suspension”, a tinted rally windshield, an\n  aluminum engine guard, and the new, enhanced version of centrifugal\n  clutch: the Easy Ride Clutch (ERC). The highlights of the new BMW F 450 GS:• Development focus: excellent handling\n  characteristics, strong performance, durability, and optimal accessibility. • Outstanding power-to-weight ratio within the A2 class: 48 hp with a\n  ready-to-ride weight of just 178 kg. • Sporty adventure bike with a twin-cylinder inline engine producing\n  35 kW (48 hp) at 8,750 rpm and a maximum torque of 43 Nm at 6,750 rpm. • Characterful engine with extremely smooth running thanks to a\n  balance shaft and 135-degree crankpin offset. Four attractive equipment variants: • Easy Ride Clutch (ERC) for significantly improved operating and\n  riding comfort, as well as dynamics, as standard in the GS Trophy trim\n  level; it can be retrofitted to all other F 450 GS model variants. • Six-speed transmission and left-mounted secondary drive.\n  Shift Assistant Pro for quick upshifts and downshifts without using\n  the clutch. • Right-side stainless steel exhaust system with two catalytic converters. • \"Rain,\" \"Road,\" and \"Enduro\" riding\n  modes, as well as ABS Pro, DBC, DTC, and MSR, are standard features\n  for a high level of riding enjoyment and safety. Additional\"Enduro Pro\" riding mode is available starting\n  with the Exclusive trim level. • Newly developed chassis with a tubular steel frame for optimal\n  rigidity, robustness, and handling precision. Short wheelbase and\n  compact packaging. • Wheel control at the front via an KYB upside-down telescopic fork\n  and at the rear via a hollow-cast aluminum double-sided swing arm with\n  a KYB central spring strut, adjustable for spring preload and rebound,\n  and with travel-dependent damping. • Wheels and tires tailored to the typical BMW GS applications. • Powerful braking system by Brembo (front) and ByBre (rear) in\n  conjunction with BMW Motorrad ABS Pro for safe braking, even when\n  leaning. Dynamic Brake Control (DBC) and Dynamic Brake Light are\n  additional safety features. • Optimum ergonomics and equipment for relaxed yet dynamic\n  motorcycling on and off-road. • High-performance touring and travel capabilities. • Footrests with adjustable gearshift and footbrake levers for\n  optimal grip on and off-road. • Adjustable hand levers as standard. • Heated grips as standard. • Powerful LED headlights and lights as standard. • Connectivity with extensive options and exemplary functionality in\n  the form of a large, perfectly legible 6.5-inch TFT display. • Practical USB-C socket in the cockpit area. • Tailor-made customization options as part of the Original BMW\n  Motorrad Accessories range in renowned premium quality, such as: - Cross-spoke wheels. - Comprehensive wind and weather protection with various windshield variants. - Various seat variants (Rally seat, low seat). - Aluminum engine guard. Here you can see the webcast of the BMW Group Keynote at the Japan Mobility Show 2025."
  }
]